## 8. Consider the following data frame containing a family name, gender of the family member and her/his monthlyincome in each record.
### Name Gender MonthlyIncome (Rs.)
### Shah Male 114000.00
### Vats Male 65000.00
### Vats Female 43150.00
### Kumar Female 69500.00
### Vats Female 155000.00
### Kumar Male 103000.00
### Shah Male 55000.00
### Shah Female 112400.00
### Kumar Female 81030.00
### Vats Male 71900.00
### Write a program in Python using Pandas to perform the following:

In [1]:
import pandas as pd
import numpy as np
name = np.array(['Shah', 'Vats', 'Kumar'])
gender = np.array(['Male', 'Female'])
dt = pd.DataFrame({
'Name' : name[[0,1,1,2,1,2,0,0,2,1]],
'Gender' : gender[[0,0,1,1,1,0,0,1,1,0]],
'MonthlyIncome' : [114000, 65000, 43150, 69500, 155000, 103000, 55000, 112400,20000,14000]})

In [2]:
dt

    Name  Gender  MonthlyIncome
0   Shah    Male         114000
1   Vats    Male          65000
2   Vats  Female          43150
3  Kumar  Female          69500
4   Vats  Female         155000
5  Kumar    Male         103000
6   Shah    Male          55000
7   Shah  Female         112400
8  Kumar  Female          20000
9   Vats    Male          14000

## a. Calculate and display familywise gross monthly income.

In [3]:
dt.groupby(by= 'Name')['MonthlyIncome'].sum()

Name
Kumar    192500
Shah     281400
Vats     277150
Name: MonthlyIncome, dtype: int64

## b. Calculate and display the member with the highest monthly income in a family.

In [4]:
dt.groupby(by=['Name','Gender'])['MonthlyIncome'].max()

Name   Gender
Kumar  Female     69500
       Male      103000
Shah   Female    112400
       Male      114000
Vats   Female    155000
       Male       65000
Name: MonthlyIncome, dtype: int64

## c. Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [5]:
dt[dt.MonthlyIncome>60000]

    Name  Gender  MonthlyIncome
0   Shah    Male         114000
1   Vats    Male          65000
3  Kumar  Female          69500
4   Vats  Female         155000
5  Kumar    Male         103000
7   Shah  Female         112400

## d. Calculate and display the average monthly income of the female members in the Shah family.

In [6]:
dt[(dt.Name == 'Shah') & (dt.Gender == 'Female')]['MonthlyIncome'].mean()

112400.0